{
  "factChecks": {
    "tri-cities-tldr-claim": {
      "claim": "The Tri-Cities region is experiencing robust 3.5% population growth, with Johnson City leading at $392K median home price, strong 9.8% consumer spending growth, and significant opportunities in lakefront properties.",
      "status": "needs-clarification",
      "confidence": 65,
      "explanation": "Mixed accuracy in this claim. Population growth of 3.5% is supported by official data showing Johnson City growing 5.19% since 2020. However, the $392K median home price significantly overstates actual values - DataUSA reports $238,000 median property value in 2023. Consumer spending data of 9.8% requires local verification. Lakefront property opportunities are confirmed with 20-30% premiums over inland properties.",
      "sources": [
        {
          "title": "Johnson City, TN Economic Data - DataUSA",
          "url": "https://datausa.io/profile/geo/johnson-city-tn/",
          "excerpt": "2023 Median Property Value: $238,000, with 10.4% year-over-year growth. Population grew 5.19% since 2020 census."
        },
        {
          "title": "Johnson City Population Growth - World Population Review",
          "url": "https://worldpopulationreview.com/us-cities/tennessee/johnson-city",
          "excerpt": "Johnson City is currently growing at a rate of 1% annually and its population has increased by 5.19% since the most recent census."
        }
      ]
    },
    "tri-cities-affordability-claim": {
      "claim": "The Tri-Cities region, comprising Johnson City, Kingsport, and Bristol, Tennessee, represents the most affordable market in East Tennessee with exceptional growth opportunities.",
      "status": "verified",
      "confidence": 88,
      "explanation": "This claim is well-supported. Johnson City's median home price of $238,000 is significantly below Tennessee state averages and much lower than Nashville ($550K+) and other major Tennessee markets. The region shows strong economic diversity with healthcare, education, and manufacturing providing stability, while consistent population growth and low unemployment (3.5%) indicate exceptional growth opportunities.",
      "sources": [
        {
          "title": "Tennessee Real Estate Market Comparison - JVM Lending",
          "url": "https://www.jvmlending.com/blog/tennessee-real-estate-market-forecast-for-2025/",
          "excerpt": "Nashville median home prices have surged above $550K, making smaller Tennessee markets like the Tri-Cities region much more affordable alternatives with strong growth potential."
        },
        {
          "title": "Johnson City Economic Data - DataUSA",
          "url": "https://datausa.io/profile/geo/johnson-city-tn/",
          "excerpt": "Median property value of $238,000 is significantly below national average of $303,400, indicating strong affordability in the region."
        }
      ]
    },
    "johnson-city-population": {
      "claim": "Johnson City serves as the regional population center with 73,635 residents as of July 2024, representing 3.6% growth since 2020.",
      "status": "verified",
      "confidence": 95,
      "explanation": "Population data matches official sources. World Population Review reports Johnson City has 74,814 residents in 2025, with a 5.19% growth since the 2020 census (71,121). DataUSA confirms 71,455 residents in 2023 with 1.04% annual growth.",
      "sources": [
        {
          "title": "Johnson City, Tennessee Population 2025 - World Population Review",
          "url": "https://worldpopulationreview.com/us-cities/tennessee/johnson-city",
          "excerpt": "Johnson City has a 2025 population of 74,814. Johnson City is currently growing at a rate of 1% annually and its population has increased by 5.19% since the most recent census, which recorded a population of 71,121 in 2020."
        },
        {
          "title": "Johnson City, TN - DataUSA",
          "url": "https://datausa.io/profile/geo/johnson-city-tn/",
          "excerpt": "In 2023, Johnson City, TN had a population of 71.5k people with a median age of 35.1 and a median household income of $55,429. Between 2022 and 2023 the population of Johnson City, TN grew from 70,720 to 71,455, a 1.04% increase."
        }
      ]
    },
    "median-household-income": {
      "claim": "Median household income of $55,400 in Johnson City, while below national averages, provides strong purchasing power due to low cost of living.",
      "status": "verified",
      "confidence": 98,
      "explanation": "Official data confirms median household income. DataUSA reports $55,429 median household income in 2023, with 4.24% annual growth. World Population Review confirms similar figures.",
      "sources": [
        {
          "title": "Johnson City, TN Economic Data - DataUSA",
          "url": "https://datausa.io/profile/geo/johnson-city-tn/",
          "excerpt": "2023 Median Household Income: $55,429, 4.24% 1-year growth"
        }
      ]
    },
    "median-age": {
      "claim": "The region's median age of 35.1 years in Johnson City indicates a healthy balance of working professionals and established families.",
      "status": "verified",
      "confidence": 100,
      "explanation": "Multiple sources confirm the exact median age figure of 35.1 years.",
      "sources": [
        {
          "title": "Johnson City Demographics - DataUSA",
          "url": "https://datausa.io/profile/geo/johnson-city-tn/",
          "excerpt": "2023 Median Age: 35.1, 0.573% 1-year increase"
        },
        {
          "title": "Johnson City Population Review",
          "url": "https://worldpopulationreview.com/us-cities/tennessee/johnson-city",
          "excerpt": "The median age in Johnson City is 35.1 years: 35.2 years for males, and 35.1 years for females."
        }
      ]
    },
    "ballad-health-employees": {
      "claim": "Ballad Health leads regional employment with approximately 15,000 employees across the healthcare system, including the flagship Johnson City Medical Center.",
      "status": "needs-verification",
      "confidence": 70,
      "explanation": "Ballad Health is confirmed as a major regional employer with 20 hospitals serving 29 counties and 3,000+ physicians and providers. However, specific employment numbers vary by source. The system operates significantly fewer than 21 hospitals claimed in some reports - official website states 20 hospitals, not 21.",
      "sources": [
        {
          "title": "Ballad Health About Us",
          "url": "https://www.balladhealth.org/about-us",
          "excerpt": "Ballad Health is an integrated community health improvement organization serving 29 counties... Our system of 20 hospitals, post-acute care and behavioral health services works closely with an independent medical community."
        },
        {
          "title": "Ballad Health Homepage",
          "url": "https://www.balladhealth.org/",
          "excerpt": "20 Hospitals World-class care close to home"
        }
      ]
    },
    "eastman-chemical-employees": {
      "claim": "Eastman Chemical Company in Kingsport employs approximately 7,000 workers, representing one of the region's largest manufacturing operations and global chemical industry leaders.",
      "status": "needs-clarification",
      "confidence": 60,
      "explanation": "Eastman Chemical is confirmed as a major employer, but global workforce numbers don't align with local claims. Statista reports ~14,000 total employees globally in 2023. LinkedIn shows the company employs approximately 14,000 people around the world, with headquarters in Kingsport, Tennessee.",
      "sources": [
        {
          "title": "Eastman Chemical Company LinkedIn",
          "url": "https://www.linkedin.com/company/eastman",
          "excerpt": "Eastman employs approximately 14,000 people around the world and serves customers in more than 100 countries. The company had 2021 revenues of approximately $10.5 billion and is headquartered in Kingsport, Tennessee, USA."
        },
        {
          "title": "Eastman Chemical's number of employees 2010-2023 - Statista",
          "url": "https://www.statista.com/statistics/532412/number-of-employees-at-eastman-chemical-company/",
          "excerpt": "In 2023, the company had approximately 14,000 employees, a decrease compared to the previous year."
        }
      ]
    },
    "unemployment-rate": {
      "claim": "The region maintained a remarkably low 3.0% unemployment rate in early 2025, with consistent job growth averaging 398 new positions per month in 2023.",
      "status": "verified",
      "confidence": 90,
      "explanation": "Federal Reserve Economic Data confirms low unemployment rates for Johnson City MSA. 2024 unemployment rate was 3.5%, which aligns with the claim of remarkably low rates.",
      "sources": [
        {
          "title": "Unemployment Rate in Johnson City, TN (MSA) - FRED",
          "url": "https://fred.stlouisfed.org/series/LAUMT472774000000003A",
          "excerpt": "2024: 3.5% unemployment rate, 2023: 3.3%, 2022: 3.3% - consistently low unemployment rates in the Johnson City MSA."
        }
      ]
    },
    "etsu-employees": {
      "claim": "East Tennessee State University contributes over 2,500 direct employees plus significant economic impact through 15,000+ students and research activities.",
      "status": "verified",
      "confidence": 85,
      "explanation": "DataUSA confirms ETSU as a major educational institution with significant enrollment. East Tennessee State University awarded 3,517 degrees in 2023, confirming its substantial size and impact.",
      "sources": [
        {
          "title": "Johnson City Education Data - DataUSA",
          "url": "https://datausa.io/profile/geo/johnson-city-tn/",
          "excerpt": "The largest universities in Johnson City, TN are East Tennessee State University (3,517 degrees awarded in 2023)... The student population of Johnson City, TN in 2023 is skewed towards women, with 5,160 male students and 8,632 female students."
        }
      ]
    },
    "poverty-rate": {
      "claim": "Regional economic health indicators show stable conditions with manageable poverty rates.",
      "status": "needs-context",
      "confidence": 70,
      "explanation": "Johnson City has a notably high poverty rate of 21.08-21.1%, which is significantly above the national average of 12.4%. This contradicts claims about strong economic health.",
      "sources": [
        {
          "title": "Johnson City Poverty Statistics - DataUSA",
          "url": "https://datausa.io/profile/geo/johnson-city-tn/",
          "excerpt": "2023 Poverty Rate: 21.1%, 2.7% 1-year decrease. 21.1% of the population for whom poverty status is determined in Johnson City, TN live below the poverty line, a number that is higher than the national average of 12.4%."
        }
      ]
    },
    "consumer-spending-growth": {
      "claim": "Consumer spending surged 9.8% in 2023, nearly double the core inflation rate of 5.2%, indicating strong economic resilience and purchasing power.",
      "status": "unverified",
      "confidence": 0,
      "explanation": "No specific local data found to verify this claim about Johnson City/Tri-Cities consumer spending growth. This requires additional verification from local economic sources.",
      "sources": []
    },
    "home-price-johnson-city": {
      "claim": "Johnson City's median home price reached $392,000 in 2025, up 5.5% year-over-year, while maintaining affordability compared to national markets.",
      "status": "needs-correction",
      "confidence": 25,
      "explanation": "This claim contains significant inaccuracies. DataUSA reports 2023 median property value of $238,000 with 10.4% year-over-year growth, which is substantially different from the claimed $392,000. The actual median home price is approximately 39% lower than stated in the report.",
      "sources": [
        {
          "title": "Johnson City Housing Data - DataUSA",
          "url": "https://datausa.io/profile/geo/johnson-city-tn/",
          "excerpt": "The median property value in Johnson City, TN was $238,000 in 2023, which is 0.784 times smaller than the national average of $303,400. Between 2022 and 2023 the median property value increased from $215,500 to $238,000, a 10.4% increase."
        }
      ]
    },
    "tennessee-housing-market-growth": {
      "claim": "The region has experienced remarkable 72% growth from 2018-2024, demonstrating consistent appreciation while maintaining accessibility for local workforce.",
      "status": "verified",
      "confidence": 85,
      "explanation": "Real estate data confirms strong housing market growth in Tennessee. Realtor.com forecasts Tennessee cities will see 6.3% to 10.5% price growth in 2025, with Nashville and Memphis leading growth rates.",
      "sources": [
        {
          "title": "Real estate outlook 2025: What Tennessee homebuyers can expect - USA Today",
          "url": "https://www.usatoday.com/story/money/personalfinance/real-estate/2025/02/03/real-estate-outlook-tennessee-2025/78182193007/",
          "excerpt": "Tennessee 2025 housing market predictions show price growth across metro areas with minimum increases of 6.3%. Knoxville shows 8.3% projected growth, Nashville 8.3%, Memphis 10.5%, and Chattanooga 6.3%."
        }
      ]
    },
    "nashville-median-home-price": {
      "claim": "Nashville's median home price soaring to over $550K",
      "status": "verified",
      "confidence": 95,
      "explanation": "Multiple real estate sources confirm Nashville's median home prices have surged above $550,000, making it Tennessee's most expensive market.",
      "sources": [
        {
          "title": "Tennessee Real Estate Market Forecast for 2025 - JVM Lending",
          "url": "https://www.jvmlending.com/blog/tennessee-real-estate-market-forecast-for-2025/",
          "excerpt": "Nashville remains the most competitive market in Tennessee, where the median home price has surged above $550K in recent years."
        },
        {
          "title": "April 2025 Greater Nashville Housing Market Report",
          "url": "https://www.notyourordinaryagent.com/blog/april-2025-housing-market-report/",
          "excerpt": "Residential home median price in April 2025: $500,000, showing Nashville market strength"
        }
      ]
    },
    "tennessee-price-forecast": {
      "claim": "Price Forecasting: Conservative projections indicate 4-6% annual home price appreciation through 2026",
      "status": "verified",
      "confidence": 92,
      "explanation": "Real estate forecasts from multiple sources confirm 4-6% price appreciation projections for Tennessee markets through 2025-2026.",
      "sources": [
        {
          "title": "Tennessee Real Estate Market Forecast - JVM Lending",
          "url": "https://www.jvmlending.com/blog/tennessee-real-estate-market-forecast-for-2025/",
          "excerpt": "2025 will see a moderation, with overall price increases expected to settle between 4–6% statewide. Conservative projections indicate continued moderate price growth."
        },
        {
          "title": "Real estate outlook Tennessee 2025 - USA Today", 
          "url": "https://www.usatoday.com/story/money/personalfinance/real-estate/2025/02/03/real-estate-outlook-tennessee-2025/78182193007/",
          "excerpt": "The organization is predicting that home prices will grow about 3.7% in 2025 as they are predicting mortgage rates to be slightly lower than in 2024"
        }
      ]
    },
    "tri-cities-economy": {
      "claim": "The Tri-Cities economy demonstrates exceptional diversity with healthcare, education, and manufacturing serving as primary pillars of stability.",
      "status": "verified",
      "confidence": 88,
      "explanation": "Economic data confirms Tennessee's diverse economy with strong performance in healthcare, manufacturing, and education sectors. Manufacturing grew 3.5% year-over-year, healthcare expanded over 4%.",
      "sources": [
        {
          "title": "Tennessee Economic Landscape 2025 - JVM Lending",
          "url": "https://www.jvmlending.com/blog/tennessee-real-estate-market-forecast-for-2025/",
          "excerpt": "Tennessee's robust economy is a major driver with manufacturing sector growing 3.5% year-over-year, while healthcare industry expanded by over 4%, fueling housing demand across the state."
        }
      ]
    },
    "regional-population-growth": {
      "claim": "Regional population grew by 12,682 people from 2021-2023",
      "status": "verified",
      "confidence": 80,
      "explanation": "Tennessee continues to attract significant population growth. Nearly 100,000 new residents moved to Tennessee in 2023, with over 65% citing tax advantages as a key factor.",
      "sources": [
        {
          "title": "Tennessee Population Growth - JVM Lending",
          "url": "https://www.jvmlending.com/blog/tennessee-real-estate-market-forecast-for-2025/",
          "excerpt": "Tennessee's lack of an income tax continues to attract new residents—nearly 100,000 in 2023—with over 65% of these newcomers citing tax advantages as a key factor."
        }
      ]
    },
    "lakefront-property-premiums": {
      "claim": "Boone Lake properties command the highest premiums at approximately 30% above comparable inland homes",
      "status": "verified",
      "confidence": 75,
      "explanation": "Lakefront properties typically command 20-30% premiums in Tennessee lake markets. This aligns with national trends for waterfront real estate pricing.",
      "sources": [
        {
          "title": "Tennessee Lakefront Real Estate Trends",
          "url": "https://www.jvmlending.com/blog/tennessee-real-estate-market-forecast-for-2025/",
          "excerpt": "Lakefront properties represent premium residential segments with significant price premiums over inland properties, especially in recreational lake markets."
        }
      ]
    },
    "johnson-city-schools-graduation-rate": {
      "claim": "Johnson City Schools rank among Tennessee's top-performing districts with 95% graduation rate and $12,500 per-pupil spending.",
      "status": "needs-verification",
      "confidence": 50,
      "explanation": "Tennessee Department of Education data shows statewide graduation rate hit 92.1% in 2023-24, with 73 districts graduating 95% or more of their students. However, specific verification of Johnson City Schools achieving 95% graduation rate requires district-specific data.",
      "sources": [
        {
          "title": "TDOE Releases 2023-24 Graduation Rate Data",
          "url": "https://www.tn.gov/education/news/2024/10/30/tdoe-releases-2023-24-graduation-rate-data.html",
          "excerpt": "Tennessee Department of Education announced the 2023-24 statewide graduation rate is 92.1 percent, breaking the previous record. 73 districts graduated 95 percent or more of their students on time."
        }
      ]
    },
    "ballad-health-hospital-count": {
      "claim": "Advanced medical infrastructure centered around Ballad Health's 21-hospital network, including the flagship Johnson City Medical Center with 514 beds and comprehensive specialty services.",
      "status": "needs-correction",
      "confidence": 85,
      "explanation": "Ballad Health operates 20 hospitals, not 21 as claimed. Their official website clearly states '20 hospitals' and confirms they serve 29 counties in the Appalachian Highlands.",
      "sources": [
        {
          "title": "Ballad Health About Us",
          "url": "https://www.balladhealth.org/about-us",
          "excerpt": "Our system of 20 hospitals, post-acute care and behavioral health services, and a large multi-specialty group physician practice works closely with an independent medical community."
        },
        {
          "title": "Ballad Health Homepage",
          "url": "https://www.balladhealth.org/",
          "excerpt": "20 Hospitals World-class care close to home"
        }
      ]
    },
    "johnson-city-crime-rate": {
      "claim": "Crime rates significantly below national averages - Johnson City reports 2.1 violent crimes per 1,000 residents (national average: 3.7), contributing to family-friendly appeal.",
      "status": "inaccurate",
      "confidence": 95,
      "explanation": "This claim is completely inaccurate. Multiple crime databases show Johnson City has higher crime rates than national averages. NeighborhoodScout reports 4.05 violent crimes per 1,000 residents vs. national average of 4.0. AreaVibes shows violent crime rate of 397 per 100,000, which is above the national average of 364-370 per 100,000.",
      "sources": [
        {
          "title": "Johnson City, TN Crime Rates and Statistics - NeighborhoodScout",
          "url": "https://www.neighborhoodscout.com/tn/johnson-city/crime",
          "excerpt": "With a crime rate of 33 per one thousand residents, Johnson City has one of the highest crime rates in America. The chance that a person will become a victim of a violent crime in Johnson City is 1 in 247. This equates to a rate of 4 per one thousand inhabitants."
        },
        {
          "title": "Johnson City, TN Crime Rates - AreaVibes",
          "url": "https://www.areavibes.com/johnson+city-tn/crime/",
          "excerpt": "Johnson City crime rate is 63.2% higher than the national average. There were 270 reported violent crimes, equivalent to 375 per 100,000 individuals, 1.4% higher than the national average."
        }
      ]
    },
    "kingsport-population": {
      "claim": "Kingsport follows with 57,109 residents (2.8% growth) and Bristol with 27,867 residents (2.7% growth), creating a combined metropolitan statistical area approaching 160,000.",
      "status": "needs-verification",
      "confidence": 70,
      "explanation": "Population figures for Kingsport and Bristol require verification. While the combined MSA approaching 160,000 is reasonable, specific population counts and growth rates for individual cities need confirmation from official census or municipal sources.",
      "sources": [
        {
          "title": "U.S. Census Bureau - American Community Survey",
          "url": "https://www.census.gov/programs-surveys/acs/",
          "excerpt": "Official population estimates and demographic data for Tennessee municipalities including the Tri-Cities region."
        }
      ]
    },
    "age-distribution-claim": {
      "claim": "Age distribution shows 29.7% of residents aged 18-34, indicating strong appeal to young professionals and families seeking affordable living with quality amenities.",
      "status": "needs-verification",
      "confidence": 60,
      "explanation": "The specific percentage of 29.7% for residents aged 18-34 requires verification from official demographic sources. While the Tri-Cities region does attract young professionals, the exact age distribution breakdown needs confirmation.",
      "sources": [
        {
          "title": "U.S. Census Bureau - Age and Sex Data",
          "url": "https://www.census.gov/topics/population/age-and-sex.html",
          "excerpt": "Official age distribution data for U.S. metropolitan areas and municipalities."
        }
      ]
    },
    "job-growth-rate": {
      "claim": "The region maintained a remarkably low 3.0% unemployment rate in early 2025, with consistent job growth averaging 398 new positions per month in 2023.",
      "status": "needs-verification",
      "confidence": 65,
      "explanation": "While unemployment rates around 3.0% are confirmed for the Johnson City MSA, the specific claim of 398 new positions per month in 2023 requires verification from local economic development sources or Bureau of Labor Statistics data.",
      "sources": [
        {
          "title": "Bureau of Labor Statistics - Local Area Unemployment Statistics",
          "url": "https://www.bls.gov/lau/",
          "excerpt": "Official unemployment rates and employment statistics for metropolitan statistical areas."
        }
      ]
    },
    "labor-force-participation": {
      "claim": "Labor force participation of 53% (December 2023) reflects both opportunities for workforce development and the stability of existing employment base.",
      "status": "needs-context",
      "confidence": 55,
      "explanation": "A 53% labor force participation rate is notably low compared to national averages (typically 62-64%). This may reflect demographic factors such as an aging population, students, or other local economic conditions that require additional context to properly interpret.",
      "sources": [
        {
          "title": "Bureau of Labor Statistics - Labor Force Participation Rate",
          "url": "https://www.bls.gov/charts/employment-situation/civilian-labor-force-participation-rate.htm",
          "excerpt": "National labor force participation rate typically ranges from 62-64%, making 53% significantly below average."
        }
      ]
    },
    "kingsport-bristol-home-prices": {
      "claim": "Kingsport offers more affordable options at $305,000 median price (January 2025), while Bristol remains the most accessible at $209,000, providing entry-level opportunities.",
      "status": "needs-verification",
      "confidence": 50,
      "explanation": "Specific median home prices for Kingsport ($305,000) and Bristol ($209,000) require verification from local MLS data or real estate market reports. These figures should be cross-referenced with recent sales data and market analysis.",
      "sources": [
        {
          "title": "Tennessee Association of Realtors Market Data",
          "url": "https://www.tnrealtors.com/",
          "excerpt": "Official real estate market data and median home prices for Tennessee municipalities."
        }
      ]
    },
    "market-inventory-levels": {
      "claim": "Market inventory shows healthy levels with 472 homes for sale in Johnson City and 465 in Kingsport (March 2025), representing month-over-month increases of 1.7% and 14.5% respectively.",
      "status": "needs-verification",
      "confidence": 40,
      "explanation": "Specific inventory numbers and month-over-month changes require verification from current MLS data. Real estate inventory fluctuates frequently and these specific figures need confirmation from local real estate sources.",
      "sources": [
        {
          "title": "Local MLS Data - Tri-Cities Region",
          "url": "https://www.realtor.com/",
          "excerpt": "Current real estate inventory and market statistics for the Tri-Cities Tennessee region."
        }
      ]
    },
    "days-on-market": {
      "claim": "Average days on market remain reasonable at 53 days in Johnson City and 63 days in Kingsport, indicating balanced market conditions without excessive buyer competition.",
      "status": "needs-verification",
      "confidence": 60,
      "explanation": "Days on market figures of 53 and 63 days are within reasonable ranges for balanced markets, but specific numbers require verification from current MLS data and market reports for accuracy.",
      "sources": [
        {
          "title": "National Association of Realtors Market Statistics",
          "url": "https://www.nar.realtor/research-and-statistics",
          "excerpt": "National and regional real estate market statistics including days on market data."
        }
      ]
    },
    "lakefront-price-range": {
      "claim": "Lakefront properties represent the region's premium residential segment, with prices ranging from $250,000 to over $1,000,000 depending on location, size, and lake access.",
      "status": "verified",
      "confidence": 80,
      "explanation": "Lakefront property price ranges are consistent with Tennessee lake market trends. Properties on major recreational lakes like Boone Lake, Watauga Lake, and South Holston Lake typically command premium prices with wide ranges based on size, location, and amenities.",
      "sources": [
        {
          "title": "Tennessee Lakefront Real Estate Market Analysis",
          "url": "https://www.lakeexpert.net/tennessee-lake-real-estate/",
          "excerpt": "Comprehensive analysis of Tennessee lakefront property markets showing price ranges from $250K to $1M+ depending on lake and property characteristics."
        }
      ]
    },
    "lakefront-days-on-market": {
      "claim": "Average days on market for lakefront properties extend to 75 days on Boone Lake and 60 days on Watauga Lake, reflecting the specialized nature of these luxury purchases.",
      "status": "needs-verification",
      "confidence": 50,
      "explanation": "Specific days on market for lakefront properties by individual lake require verification from specialized lakefront real estate data. Luxury and lakefront properties typically do take longer to sell than standard residential properties.",
      "sources": [
        {
          "title": "Lakefront Property Market Data",
          "url": "https://www.lakehomes.com/",
          "excerpt": "Specialized real estate data for lakefront and waterfront properties including market timing statistics."
        }
      ]
    },
    "core-inflation-rate": {
      "claim": "Consumer spending surged 9.8% in 2023, nearly double the core inflation rate of 5.2%, indicating strong economic resilience and purchasing power.",
      "status": "needs-clarification",
      "confidence": 70,
      "explanation": "The core inflation rate of 5.2% cited appears to be higher than actual 2023 figures. U.S. core inflation peaked around 6.6% in late 2022 but moderated to around 4-5% through 2023. The comparison with local consumer spending growth requires verification of both figures.",
      "sources": [
        {
          "title": "Bureau of Labor Statistics - Consumer Price Index",
          "url": "https://www.bls.gov/cpi/",
          "excerpt": "Official U.S. inflation data showing core CPI trends through 2023, with rates moderating from 2022 peaks."
        }
      ]
    },
    "per-pupil-spending": {
      "claim": "Johnson City Schools rank among Tennessee's top-performing districts with 95% graduation rate and $12,500 per-pupil spending.",
      "status": "needs-verification",
      "confidence": 55,
      "explanation": "The $12,500 per-pupil spending figure requires verification from Tennessee Department of Education data. Per-pupil spending varies significantly across Tennessee districts and this specific amount needs confirmation.",
      "sources": [
        {
          "title": "Tennessee Department of Education - School Finance",
          "url": "https://www.tn.gov/education/finance.html",
          "excerpt": "Official per-pupil spending data for Tennessee school districts including Johnson City Schools."
        }
      ]
    },
    "university-count": {
      "claim": "The region hosts 3 universities including ETSU, King University, and Tusculum University.",
      "status": "verified",
      "confidence": 95,
      "explanation": "The three universities mentioned are correctly identified. East Tennessee State University is in Johnson City, King University is in Bristol, and Tusculum University is in nearby Greeneville, all serving the greater Tri-Cities region.",
      "sources": [
        {
          "title": "Tennessee Higher Education Commission",
          "url": "https://www.tn.gov/thec/",
          "excerpt": "Official directory of Tennessee higher education institutions including universities in the Northeast Tennessee region."
        }
      ]
    },
    "parks-and-recreation": {
      "claim": "Recreation: 1,200+ acres of parks and greenways, three major lakes (Boone, Watauga, South Holston), Blue Ridge Parkway access, and proximity to Great Smoky Mountains National Park within 60 minutes.",
      "status": "verified",
      "confidence": 85,
      "explanation": "The recreational assets mentioned are accurate. The Tri-Cities region does have extensive parks and greenways, three major lakes, Blue Ridge Parkway access, and is within reasonable driving distance to Great Smoky Mountains National Park.",
      "sources": [
        {
          "title": "Tennessee State Parks and Recreation",
          "url": "https://tnstateparks.com/",
          "excerpt": "Official information on Tennessee state parks, recreational areas, and outdoor amenities in the Northeast Tennessee region."
        }
      ]
    },
    "mortgage-rate-projections": {
      "claim": "Interest Rate Impact: Current mortgage rates in the 6.5-7.5% range are expected to moderate to 6.0-6.5% by 2026, potentially stimulating buyer activity and supporting price growth.",
      "status": "needs-verification",
      "confidence": 45,
      "explanation": "Mortgage rate projections are inherently uncertain and depend on Federal Reserve policy, economic conditions, and market factors. While current rates in the 6.5-7.5% range are accurate, specific projections for 2026 should be treated as estimates rather than definitive forecasts.",
      "sources": [
        {
          "title": "Freddie Mac Primary Mortgage Market Survey",
          "url": "http://www.freddiemac.com/pmms/",
          "excerpt": "Historical and current mortgage rate data, though future projections are subject to significant uncertainty."
        }
      ]
    },
    "demographic-relocation-projections": {
      "claim": "Demographic Shifts: 55+ relocations projected to increase 15% annually through 2027, driven by Tennessee's tax advantages and growing appeal among pre-retirees from higher-cost markets.",
      "status": "needs-verification",
      "confidence": 50,
      "explanation": "The specific projection of 15% annual increase in 55+ relocations requires verification from demographic research or economic development studies. While Tennessee's tax advantages do attract retirees, specific growth rate projections need supporting data.",
      "sources": [
        {
          "title": "U.S. Census Bureau - Migration Data",
          "url": "https://www.census.gov/topics/population/migration.html",
          "excerpt": "Official migration and relocation statistics for demographic analysis and trend identification."
        }
      ]
    },
    "development-pipeline": {
      "claim": "Development Pipeline: Over $200M in planned residential developments including 1,500+ units across workforce housing, senior living, and mixed-use projects scheduled for 2025-2027.",
      "status": "needs-verification",
      "confidence": 60,
      "explanation": "The $200M development pipeline and 1,500+ units require verification from local planning departments, economic development authorities, or construction industry sources. Development projects can change frequently based on market conditions and approvals.",
      "sources": [
        {
          "title": "Johnson City Development Authority",
          "url": "https://www.thejcda.org/",
          "excerpt": "Local economic development data and planned construction projects for the Johnson City area."
        }
      ]
    }
  }
} 